In [1]:
# Adding Coloumn
# Using Literal
# Renaming Colimns
# Removing Coloumns
# Filtering and LIMIT for DataFrame
# Structured Transformations - with column , lit

In [2]:
from pyspark.sql import SparkSession

spark=SparkSession.builder.getOrCreate()

In [3]:
spark

In [4]:
# Emp Data & Schema

emp_data = [
    ["001","101","John Doe","30","Male","50000","2015-01-01"],
    ["002","101","Jane Smith","25","Female","45000","2016-02-15"],
    ["003","102","Bob Brown","35","Male","55000","2014-05-01"],
    ["004","102","Alice Lee","28","Female","48000","2017-09-30"],
    ["005","103","Jack Chan","40","Male","60000","2013-04-01"],
    ["006","103","Jill Wong","32","Female","52000","2018-07-01"],
    ["007","101","James Johnson","42","Male","70000","2012-03-15"],
    ["008","102","Kate Kim","29","Female","51000","2019-10-01"],
    ["009","103","Tom Tan","33","Male","58000","2016-06-01"],
    ["010","104","Lisa Lee","27","Female","47000","2018-08-01"],
    ["011","104","David Park","38","Male","65000","2015-11-01"],
    ["012","105","Susan Chen","31","Female","54000","2017-02-15"],
    ["013","106","Brian Kim","45","Male","75000","2011-07-01"],
    ["014","107","Emily Lee","26","Female","46000","2019-01-01"],
    ["015","106","Michael Lee","37","Male","63000","2014-09-30"],
    ["016","107","Kelly Zhang","30","Female","49000","2018-04-01"],
    ["017","105","George Wang","34","Male","57000","2016-03-15"],
    ["018","104","Nancy Liu","29","Female","50000","2017-06-01"],
    ["019","103","Steven Chen","36","Male","62000","2015-08-01"],
    ["020","102","Grace Kim","32","Female","53000","2018-11-01"]
]

emp_schema = "employee_id string, department_id string, name string, age string, gender string, salary string, hire_date string"

In [9]:
emp_df= spark.createDataFrame(emp_data,emp_schema)

In [10]:
emp_df.show()

+-----------+-------------+-------------+---+------+------+----------+
|employee_id|department_id|         name|age|gender|salary| hire_date|
+-----------+-------------+-------------+---+------+------+----------+
|        001|          101|     John Doe| 30|  Male| 50000|2015-01-01|
|        002|          101|   Jane Smith| 25|Female| 45000|2016-02-15|
|        003|          102|    Bob Brown| 35|  Male| 55000|2014-05-01|
|        004|          102|    Alice Lee| 28|Female| 48000|2017-09-30|
|        005|          103|    Jack Chan| 40|  Male| 60000|2013-04-01|
|        006|          103|    Jill Wong| 32|Female| 52000|2018-07-01|
|        007|          101|James Johnson| 42|  Male| 70000|2012-03-15|
|        008|          102|     Kate Kim| 29|Female| 51000|2019-10-01|
|        009|          103|      Tom Tan| 33|  Male| 58000|2016-06-01|
|        010|          104|     Lisa Lee| 27|Female| 47000|2018-08-01|
|        011|          104|   David Park| 38|  Male| 65000|2015-11-01|
|        012|          105|   Susan Chen| 31|Female| 54000|2017-02-15|
|        013|          106|    Brian Kim| 45|  Male| 75000|2011-07-01|
|        014|          107|    Emily Lee| 26|Female| 46000|2019-01-01|
|        015|          106|  Michael Lee| 37|  Male| 63000|2014-09-30|
|        016|          107|  Kelly Zhang| 30|Female| 49000|2018-04-01|
|        017|          105|  George Wang| 34|  Male| 57000|2016-03-15|
|        018|          104|    Nancy Liu| 29|Female| 50000|2017-06-01|
|        019|          103|  Steven Chen| 36|  Male| 62000|2015-08-01|
|        020|          102|    Grace Kim| 32|Female| 53000|2018-11-01|
+-----------+-------------+-------------+---+------+------+----------+

In [11]:
emp_df.printSchema()

root
 |-- employee_id: string (nullable = true)
 |-- department_id: string (nullable = true)
 |-- name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: string (nullable = true)
 |-- hire_date: string (nullable = true)

In [17]:
## CastingColumn
# Casting means converting a column from one data type to another data type.
# Using select() (Not Recommended for Single Column Change)
# If transforming everything → use select()

from pyspark.sql.functions import col, cast
emp_casted =emp_df.select("employee_id","name","age",col("salary").cast("double"))

# With this method You are recreating the entire DataFrame
# You must explicitly mention all columns
# If you forget one → it will be dropped

In [19]:
emp_casted.printSchema()
emp_casted.show()

root
 |-- employee_id: string (nullable = true)
 |-- name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- salary: double (nullable = true)

+-----------+-------------+---+-------+
|employee_id|         name|age| salary|
+-----------+-------------+---+-------+
|        001|     John Doe| 30|50000.0|
|        002|   Jane Smith| 25|45000.0|
|        003|    Bob Brown| 35|55000.0|
|        004|    Alice Lee| 28|48000.0|
|        005|    Jack Chan| 40|60000.0|
|        006|    Jill Wong| 32|52000.0|
|        007|James Johnson| 42|70000.0|
|        008|     Kate Kim| 29|51000.0|
|        009|      Tom Tan| 33|58000.0|
|        010|     Lisa Lee| 27|47000.0|
|        011|   David Park| 38|65000.0|
|        012|   Susan Chen| 31|54000.0|
|        013|    Brian Kim| 45|75000.0|
|        014|    Emily Lee| 26|46000.0|
|        015|  Michael Lee| 37|63000.0|
|        016|  Kelly Zhang| 30|49000.0|
|        017|  George Wang| 34|57000.0|
|        018|    Nancy Liu| 29|50000.0|
|        019|  Steven Chen| 36|62000.0|
|        020|    Grace Kim| 32|53000.0|
+-----------+-------------+---+-------+

In [20]:
# Use withColumn() when modifying only one column:
# withColumn("column_name", expression)

from pyspark.sql.functions import col

emp_casted_one_col = emp_df.withColumn("salary", col("salary").cast("double"))

In [65]:
emp_casted_one_col.show(5)

+-----------+-------------+----------+---+------+-------+----------+
|employee_id|department_id|      name|age|gender| salary| hire_date|
+-----------+-------------+----------+---+------+-------+----------+
|        001|          101|  John Doe| 30|  Male|50000.0|2015-01-01|
|        002|          101|Jane Smith| 25|Female|45000.0|2016-02-15|
|        003|          102| Bob Brown| 35|  Male|55000.0|2014-05-01|
|        004|          102| Alice Lee| 28|Female|48000.0|2017-09-30|
|        005|          103| Jack Chan| 40|  Male|60000.0|2013-04-01|
+-----------+-------------+----------+---+------+-------+----------+
only showing top 5 rows

In [66]:
# Adding Column on emp_casted
# now we are calucating the tax from the salary 
# withColumn() is used to:

# 1️ Modify an existing column
# 2️ Add a new column
# 3️ Create calculated columns

# Here with column will use to add the column

emp_taxed = emp_casted.withColumn("tax", col("salary") * 0.2)
emp_taxed.show()

+-----------+-------------+---+-------+-------+
|employee_id|         name|age| salary|    tax|
+-----------+-------------+---+-------+-------+
|        001|     John Doe| 30|50000.0|10000.0|
|        002|   Jane Smith| 25|45000.0| 9000.0|
|        003|    Bob Brown| 35|55000.0|11000.0|
|        004|    Alice Lee| 28|48000.0| 9600.0|
|        005|    Jack Chan| 40|60000.0|12000.0|
|        006|    Jill Wong| 32|52000.0|10400.0|
|        007|James Johnson| 42|70000.0|14000.0|
|        008|     Kate Kim| 29|51000.0|10200.0|
|        009|      Tom Tan| 33|58000.0|11600.0|
|        010|     Lisa Lee| 27|47000.0| 9400.0|
|        011|   David Park| 38|65000.0|13000.0|
|        012|   Susan Chen| 31|54000.0|10800.0|
|        013|    Brian Kim| 45|75000.0|15000.0|
|        014|    Emily Lee| 26|46000.0| 9200.0|
|        015|  Michael Lee| 37|63000.0|12600.0|
|        016|  Kelly Zhang| 30|49000.0| 9800.0|
|        017|  George Wang| 34|57000.0|11400.0|
|        018|    Nancy Liu| 29|50000.0|10000.0|
|        019|  Steven Chen| 36|62000.0|12400.0|
|        020|    Grace Kim| 32|53000.0|10600.0|
+-----------+-------------+---+-------+-------+

In [67]:
 # Literals
# In Spark, literal means a fixed constant value.
from pyspark.sql.functions import lit

emp_lit= emp_taxed.withColumn("Country",lit('India')).withColumn("County_Code",lit(91))
emp_lit.show()

+-----------+-------------+---+-------+-------+-------+-----------+
|employee_id|         name|age| salary|    tax|Country|County_Code|
+-----------+-------------+---+-------+-------+-------+-----------+
|        001|     John Doe| 30|50000.0|10000.0|  India|         91|
|        002|   Jane Smith| 25|45000.0| 9000.0|  India|         91|
|        003|    Bob Brown| 35|55000.0|11000.0|  India|         91|
|        004|    Alice Lee| 28|48000.0| 9600.0|  India|         91|
|        005|    Jack Chan| 40|60000.0|12000.0|  India|         91|
|        006|    Jill Wong| 32|52000.0|10400.0|  India|         91|
|        007|James Johnson| 42|70000.0|14000.0|  India|         91|
|        008|     Kate Kim| 29|51000.0|10200.0|  India|         91|
|        009|      Tom Tan| 33|58000.0|11600.0|  India|         91|
|        010|     Lisa Lee| 27|47000.0| 9400.0|  India|         91|
|        011|   David Park| 38|65000.0|13000.0|  India|         91|
|        012|   Susan Chen| 31|54000.0|10800.0|  India|         91|
|        013|    Brian Kim| 45|75000.0|15000.0|  India|         91|
|        014|    Emily Lee| 26|46000.0| 9200.0|  India|         91|
|        015|  Michael Lee| 37|63000.0|12600.0|  India|         91|
|        016|  Kelly Zhang| 30|49000.0| 9800.0|  India|         91|
|        017|  George Wang| 34|57000.0|11400.0|  India|         91|
|        018|    Nancy Liu| 29|50000.0|10000.0|  India|         91|
|        019|  Steven Chen| 36|62000.0|12400.0|  India|         91|
|        020|    Grace Kim| 32|53000.0|10600.0|  India|         91|
+-----------+-------------+---+-------+-------+-------+-----------+

In [68]:
#Rename the coloumn
#Use withColumnRenamed

emp_lit = emp_lit.withColumnRenamed("employee_id","emp_id")
emp_lit.show()

+------+-------------+---+-------+-------+-------+-----------+
|emp_id|         name|age| salary|    tax|Country|County_Code|
+------+-------------+---+-------+-------+-------+-----------+
|   001|     John Doe| 30|50000.0|10000.0|  India|         91|
|   002|   Jane Smith| 25|45000.0| 9000.0|  India|         91|
|   003|    Bob Brown| 35|55000.0|11000.0|  India|         91|
|   004|    Alice Lee| 28|48000.0| 9600.0|  India|         91|
|   005|    Jack Chan| 40|60000.0|12000.0|  India|         91|
|   006|    Jill Wong| 32|52000.0|10400.0|  India|         91|
|   007|James Johnson| 42|70000.0|14000.0|  India|         91|
|   008|     Kate Kim| 29|51000.0|10200.0|  India|         91|
|   009|      Tom Tan| 33|58000.0|11600.0|  India|         91|
|   010|     Lisa Lee| 27|47000.0| 9400.0|  India|         91|
|   011|   David Park| 38|65000.0|13000.0|  India|         91|
|   012|   Susan Chen| 31|54000.0|10800.0|  India|         91|
|   013|    Brian Kim| 45|75000.0|15000.0|  India|         91|
|   014|    Emily Lee| 26|46000.0| 9200.0|  India|         91|
|   015|  Michael Lee| 37|63000.0|12600.0|  India|         91|
|   016|  Kelly Zhang| 30|49000.0| 9800.0|  India|         91|
|   017|  George Wang| 34|57000.0|11400.0|  India|         91|
|   018|    Nancy Liu| 29|50000.0|10000.0|  India|         91|
|   019|  Steven Chen| 36|62000.0|12400.0|  India|         91|
|   020|    Grace Kim| 32|53000.0|10600.0|  India|         91|
+------+-------------+---+-------+-------+-------+-----------+

In [69]:
#Coloumn name with spaces
#But Space not recomanded in Project because maybe Downstream data will have Issue
emp_lit_withspace = emp_lit.withColumnRenamed("emp_id","emp id")
emp_lit_withspace.show()

+------+-------------+---+-------+-------+-------+-----------+
|emp id|         name|age| salary|    tax|Country|County_Code|
+------+-------------+---+-------+-------+-------+-----------+
|   001|     John Doe| 30|50000.0|10000.0|  India|         91|
|   002|   Jane Smith| 25|45000.0| 9000.0|  India|         91|
|   003|    Bob Brown| 35|55000.0|11000.0|  India|         91|
|   004|    Alice Lee| 28|48000.0| 9600.0|  India|         91|
|   005|    Jack Chan| 40|60000.0|12000.0|  India|         91|
|   006|    Jill Wong| 32|52000.0|10400.0|  India|         91|
|   007|James Johnson| 42|70000.0|14000.0|  India|         91|
|   008|     Kate Kim| 29|51000.0|10200.0|  India|         91|
|   009|      Tom Tan| 33|58000.0|11600.0|  India|         91|
|   010|     Lisa Lee| 27|47000.0| 9400.0|  India|         91|
|   011|   David Park| 38|65000.0|13000.0|  India|         91|
|   012|   Susan Chen| 31|54000.0|10800.0|  India|         91|
|   013|    Brian Kim| 45|75000.0|15000.0|  India|         91|
|   014|    Emily Lee| 26|46000.0| 9200.0|  India|         91|
|   015|  Michael Lee| 37|63000.0|12600.0|  India|         91|
|   016|  Kelly Zhang| 30|49000.0| 9800.0|  India|         91|
|   017|  George Wang| 34|57000.0|11400.0|  India|         91|
|   018|    Nancy Liu| 29|50000.0|10000.0|  India|         91|
|   019|  Steven Chen| 36|62000.0|12400.0|  India|         91|
|   020|    Grace Kim| 32|53000.0|10600.0|  India|         91|
+------+-------------+---+-------+-------+-------+-----------+

In [70]:
#Remove Column

#To delete multiple Column
# emp_dropped=emp_lit.drop("County_Code", "Country")
emp_dropped=emp_lit.drop("County_Code")
emp_dropped.show()

+------+-------------+---+-------+-------+-------+
|emp_id|         name|age| salary|    tax|Country|
+------+-------------+---+-------+-------+-------+
|   001|     John Doe| 30|50000.0|10000.0|  India|
|   002|   Jane Smith| 25|45000.0| 9000.0|  India|
|   003|    Bob Brown| 35|55000.0|11000.0|  India|
|   004|    Alice Lee| 28|48000.0| 9600.0|  India|
|   005|    Jack Chan| 40|60000.0|12000.0|  India|
|   006|    Jill Wong| 32|52000.0|10400.0|  India|
|   007|James Johnson| 42|70000.0|14000.0|  India|
|   008|     Kate Kim| 29|51000.0|10200.0|  India|
|   009|      Tom Tan| 33|58000.0|11600.0|  India|
|   010|     Lisa Lee| 27|47000.0| 9400.0|  India|
|   011|   David Park| 38|65000.0|13000.0|  India|
|   012|   Susan Chen| 31|54000.0|10800.0|  India|
|   013|    Brian Kim| 45|75000.0|15000.0|  India|
|   014|    Emily Lee| 26|46000.0| 9200.0|  India|
|   015|  Michael Lee| 37|63000.0|12600.0|  India|
|   016|  Kelly Zhang| 30|49000.0| 9800.0|  India|
|   017|  George Wang| 34|57000.0|11400.0|  India|
|   018|    Nancy Liu| 29|50000.0|10000.0|  India|
|   019|  Steven Chen| 36|62000.0|12400.0|  India|
|   020|    Grace Kim| 32|53000.0|10600.0|  India|
+------+-------------+---+-------+-------+-------+

In [71]:
#Filter Data
emp_filtered = emp_dropped.where("tax>10000")
emp_filtered.show()

+------+-------------+---+-------+-------+-------+
|emp_id|         name|age| salary|    tax|Country|
+------+-------------+---+-------+-------+-------+
|   003|    Bob Brown| 35|55000.0|11000.0|  India|
|   005|    Jack Chan| 40|60000.0|12000.0|  India|
|   006|    Jill Wong| 32|52000.0|10400.0|  India|
|   007|James Johnson| 42|70000.0|14000.0|  India|
|   008|     Kate Kim| 29|51000.0|10200.0|  India|
|   009|      Tom Tan| 33|58000.0|11600.0|  India|
|   011|   David Park| 38|65000.0|13000.0|  India|
|   012|   Susan Chen| 31|54000.0|10800.0|  India|
|   013|    Brian Kim| 45|75000.0|15000.0|  India|
|   015|  Michael Lee| 37|63000.0|12600.0|  India|
|   017|  George Wang| 34|57000.0|11400.0|  India|
|   019|  Steven Chen| 36|62000.0|12400.0|  India|
|   020|    Grace Kim| 32|53000.0|10600.0|  India|
+------+-------------+---+-------+-------+-------+

In [72]:

#Limit data

emp_limit= emp_filtered.limit(5)

# With show we can use that but when we want to store use limit
emp_limit.show(2)

+------+---------+---+-------+-------+-------+
|emp_id|     name|age| salary|    tax|Country|
+------+---------+---+-------+-------+-------+
|   003|Bob Brown| 35|55000.0|11000.0|  India|
|   005|Jack Chan| 40|60000.0|12000.0|  India|
+------+---------+---+-------+-------+-------+
only showing top 2 rows

In [73]:
#Adding multiple Columns
# Use dictnories
columns = {
    "tax" : col("salary") * 0.2 ,
    "oneNumber" : lit(1), 
    "columnTwo" : lit("two")
}
emp_final = emp_df.withColumns(columns)

emp_final.show(5)

+-----------+-------------+----------+---+------+------+----------+-------+---------+---------+
|employee_id|department_id|      name|age|gender|salary| hire_date|    tax|oneNumber|columnTwo|
+-----------+-------------+----------+---+------+------+----------+-------+---------+---------+
|        001|          101|  John Doe| 30|  Male| 50000|2015-01-01|10000.0|        1|      two|
|        002|          101|Jane Smith| 25|Female| 45000|2016-02-15| 9000.0|        1|      two|
|        003|          102| Bob Brown| 35|  Male| 55000|2014-05-01|11000.0|        1|      two|
|        004|          102| Alice Lee| 28|Female| 48000|2017-09-30| 9600.0|        1|      two|
|        005|          103| Jack Chan| 40|  Male| 60000|2013-04-01|12000.0|        1|      two|
+-----------+-------------+----------+---+------+------+----------+-------+---------+---------+
only showing top 5 rows